In [1]:
import numpy as np
import pandas as pd

In [2]:
df = pd.DataFrame({'col1' : [1, 2, 3, 4],
                   'col2' : [444, 555, 666, 444],
                   'col3' : ['abc', 'def', 'ghi', 'xyz']})
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [3]:
#To check the unique values in a Series, call the unique method
df['col2'].unique()

array([444, 555, 666], dtype=int64)

In [4]:
#The two following code snippets do the same thing
len(df['col2'].unique())

3

In [5]:
df['col2'].nunique()

3

In [6]:
#To see the counts of each value, try value_counts
df['col2'].value_counts()

444    2
555    1
666    1
Name: col2, dtype: int64

In [15]:
#Reminder on how to use complex conditional selection
df[(df['col1'] > 2) & (df['col2'] == 444)]

   col1  col2 col3
3     4   444  xyz

In [16]:
#How to apply your own function to a dataframe
def times2(x):
    return x * 2

In [17]:
df['col1'].apply(times2)

0    2
1    4
2    6
3    8
Name: col1, dtype: int64

In [21]:
df['col1'].apply(lambda x: x*2)

0    2
1    4
2    6
3    8
Name: col1, dtype: int64

In [22]:
#You can sort the dataframe with respect to a specified column
df.sort_values('col2')

   col1  col2 col3
0     1   444  abc
3     4   444  xyz
1     2   555  def
2     3   666  ghi

In [24]:
#We have no null elements, so every element in the bool df
#will be false
df.isnull()

    col1   col2   col3
0  False  False  False
1  False  False  False
2  False  False  False
3  False  False  False

In [26]:
data = {'A':['foo','foo','foo','bar','bar','bar'],
     'B':['one','one','two','two','one','one'],
       'C':['x','y','x','y','x','y'],
       'D':[1,3,2,5,4,1]}

df = pd.DataFrame(data)
df

     A    B  C  D
0  foo  one  x  1
1  foo  one  y  3
2  foo  two  x  2
3  bar  two  y  5
4  bar  one  x  4
5  bar  one  y  1

In [28]:
df.pivot_table(values = 'D', index = ['A', 'B'], columns = 'C')

C          x    y
A   B
bar one  4.0  1.0
    two  NaN  5.0
foo one  1.0  3.0
    two  2.0  NaN